const express = require("express");
const PDFDocument = require("pdfkit");
const app = express();
const router = express.Router();
const path = require("path");
const fs = require("fs");
const conversion = require("phantom-html-to-pdf")();

const obituaryPdfTemplate = params => {
  return `
    <!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
    <style>
        @font-face {
            font-family: 'Conv_maveerar';
            src: url('http://tamilmemorial.s3-website.eu-west-2.amazonaws.com/maveerar/fonts/maveerar.eot');
            src: local('☺'), url('http://tamilmemorial.s3-website.eu-west-2.amazonaws.com/maveerar/fonts/maveerar.woff') format('woff'),
            url('http://tamilmemorial.s3-website.eu-west-2.amazonaws.com/maveerar/fonts/maveerar.ttf') format('truetype'),
            url('http://tamilmemorial.s3-website.eu-west-2.amazonaws.com/maveerar/fonts/maveerar.svg') format('svg');
            font-weight: normal;
            font-style: normal;
        }

        @font-face {
            font-family: 'abirami';
            src: url('http://tamilmemorial.s3-website.eu-west-2.amazonaws.com/abiramy/abirami.ttf');
            font-weight: normal;
            font-style: normal;
        }

        .first-page {
            margin: 50px;
            padding: 50px;
            border: 5px solid #000;
            text-align: center !important;
        }

        .page {
            padding: 50px;
            text-align: center !important;
            line-height: 1em;
        }

        .static_page {
            line-height: 0.87em;
        }

        .site_image,
        .site_image_large {
            width: 400px;
            height: 400px;
            display: block !important;
            margin-left: auto;
            margin-right: auto;
        }

        .site_image_large {
            width: 550px !important;
            height: 550px !important;
        }

        .left {
            float: left;
        }

        .right {
            float: right;
        }

        h1,
        h2,
        h3,
        h4,
        h5,
        h6 {
            font-family: 'Abirami' !important;
            font-weight: normal !important;
        }

        .maveerar {
            font-family: 'Maveerar' !important;
        }

        .large {
            font-size: 3.5em;
        }

        .left-align {
            text-align: left;
            margin-left: 120px;
        }

        .left-align-large {
            text-align: left;
            margin-left: 150px !important;
        }

        .center-align {
            margin-left: 100px;
        }

    </style>
</head>

<body>
    <div id="content">
        <div class="first-page">
            <img src=${params.avatar} alt=${params.name}/>
                <h3>பிறந்த இடம் :
                    <%= @site.birth_place %>
                </h3>
                <h3>வாழ்ந்த இடம் :
                    <%= @site.living_place %>
                </h3>
                <h2 style="margin-top: 35px;">அமரர்</h3>
                    <h3>
                    ${params.name}
                    </h3>
                    <h1 class="maveerar">
                        <b>
                        ${params.name}
                        </b>
                    </h1>
                    <h3>அவர்களின்</h3>
                    <h3>அமரத்துவ நிலை குறித்து</h3>
                    <h3>வெளியிடப்பட்ட</h3>
                    <h1 class="maveerar large" style="margin-left: 30px;">நினைவு மலர்</h1>
                    <h1>
                        <b>
                        ${params.death}
                        </b>
                    </h1>
        </div>
        <br>
        <br>
        <br>
        <div style="height: 1150px;">

        </div>
        <div class="page">
            <h3>வையத்துள் வாழ்வாங்கு வாழ்பவன் வானுறையும்</h3>
            <h3>தெய்வத்துள் வைக்கப் படும்.</h3>
            <br>
            <br>
            <img src=${params.avatar} alt=${params.name}/>
                <br>
                <br>
                <div class="left" style="margin-left: 40px;">
                    <h2>தோற்றம்</h2>
                    <h2>
                        <b>
                        ${params.born}
                        </b>
                    </h2>
                </div>
                <div class="right" style="margin-right: 40px;">
                    <h2>மறைவு</h2>
                    <h2>
                        <b>
                        ${params.death}>
                        </b>
                    </h2>
                </div>
                <div style="height: 100px;"></div>
                <h3>
                    ${params.name}
                </h3>
                <h1 class="maveerar">
                    ${params.name}
                </h1>
                <h3>அவர்கள்</h3>
        </div>
        <div style="height: 1350px;">
        </div>
        <div class="page" style="margin-top: 200px;">
            <h2>சமர்ப்பணம்</h2>
            <div>
                <h3>இக்குடும்பத்தின் ஒளிவிளக்காக</h3>
                <h3>கோவில் தொண்டனாக</h3>
                <h3>மண்ணின் மைந்தனாய்</h3>
                <h3>பாசமும் நேசமும் வைத்து</h3>
                <h3>வையகத்துள் வாழ்வாங்கு வாழ்ந்து</h3>
                <h3>வானுறையூம் தெய்வமாய் மிளிரும்</h3>
                <h3>எமதருமை தந்தையாருக்கு</h3>
                <h3>இம்மடலை</h3>
                <h3>காணிக்கையாக்குகின்றோம்.</h3>
                <br>
                <h3>ஓம் சாந்தி! ஓம் சாந்தி!! ஓம் சாந்தி!!!</h3>
                <br>
                <h3>இங்கனம்</h3>
                <h3>குடும்பத்தினர்</h3>
            </div>
            <div style="height: 1450px;">
            </div>
            <div class="static_page">
                <%= render 'header_one' %>
                    <h3>உ</h3>
                    <br>
                    <h1 style="font-weight: 800;">தோத்திரப் பாடல்கள்</h1>
                    <br>
                    <div>
                        <h3>திருச்சிற்றம்பலம்</h3>
                        <h2 style="margin-top: 50px;">விநாயகர் துதி</h2>
                        <br>
                        <h3>ஐந்து கரத்தனை ஆனை முகத்தனை</h3>
                        <h3>இந்தின் இளம்பிறை போலும் எயிற்றனை</h3>
                        <h3>நந்தி மகந்தனை ஞானக்கொழுந்தினை</h3>
                        <h3>புந்தியில் வைத்தடி போற்று கின்றேனே.</h3>
                    </div>
                    <br>
                    <div>
                        <h2>தேவாரம்</h2>
                        <br>
                        <h3>பூவினுங் கருங்கலம் பொங்கு தாமரை</h3>
                        <h3>ஆவினுங் கருங்கலம் அரணஞ் சாடுதல்</h3>
                        <h3>கோவினுங் கருங்கலம் கோட்ட மில்லது</h3>
                        <h3>நாவினுங்க கருங்கலம் நமச் சிவாயவே.</h3>
                    </div>
                    <br>
                    <div>
                        <h2>திருவாசகம்</h2>
                        <br>
                        <h3>அன்றேயென்றென் ஆவியூம் உடலும்</h3>
                        <h3>உடமை யெல்லாமும்</h3>
                        <h3>குன்றே யனையாம் என்னை யாட்கொண்ட</h3>
                        <h3>போதே கொண்டிலையோ</h3>
                        <h3>இன்றௌரிடையூறு</h3>
                        <h3>எண் தோள் முக்கண் எம்மானே</h3>
                        <h3>நன்றே செய்வாய் பிழை செய்வாய்</h3>
                        <h3>நானோ இதற்கு நாயகமே.</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 110px;">
                    </div>
                    <h3>1</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <br>
                    <div>
                        <h2>திருவிசைப்பா</h2>
                        <br>
                        <h3>ஏக நாயகனை இமயவர்க் கரசை</h3>
                        <h3>என்னுயிர்க் கமுதினை யெதிரில்</h3>
                        <h3>போக நாயகனைப் புயல் வண்ணற் கருளிப்</h3>
                        <h3>பொன்னெடுங் சிவிகை யாவூர்ந்த</h3>
                        <h3>மேக நாயகனை மிரு திரு விழி</h3>
                        <h3>மிழலை விண்ணிழி செழுங் கோயில்</h3>
                        <h3>யோக நாயகனை யன்றி மற்றொன்றும்</h3>
                        <h3>உண்டென வூணர்கிலேன் யானே.</h3>
                    </div>
                    <br>
                    <div>
                        <h2>திருப்பல்லாண்டு</h2>
                        <br>
                        <h3>மிண்டு மனத்தவர் போமின்கள் மெய்யடியார்கள் விரைந்து வம்மின்</h3>
                        <h3>கொண்டுங் கொடுத்தும் குடிகுடி ஈசற்(கு)ஆட் செய்மின் குழாம்புகுந்து</h3>
                        <h3>அண்டங் கடந்த பொருள்அள வில்லதோர் ஆனந்த வெள்ளப்பொருள்</h3>
                        <h3>பண்டும் இன்றும் என்றும் உள்ளபொருள் என்றே பல்லாண்டு கூறுதுமே.</h3>
                    </div>
                    <br>
                    <div>
                        <h2>திருப்புராணம்</h2>
                        <br>
                        <h3>தெண்ணிலா மலர்ந்த வேணியாய் உன்றன்</h3>
                        <h3>திருநடம் குமிபடப் பெற்று</h3>
                        <h3>மண்ணிலே வந்த இப்பிறவியிலே எனக்கு</h3>
                        <h3>வலிதான் இன்பமாம் என்ற</h3>
                        <h3>கண்ணிலானந்த அருவி நீர் சொரியக்</h3>
                        <h3>கைமலர் உச்சிமேற் குவித்துப்</h3>
                        <h3>பண்ணினால் நீடி அறிவரும் பதிகம்</h3>
                        <h3>பாடினார் பரவினார் பணிந்தார்.</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 170px;">
                    </div>
                    <h3>2</h3>
            </div>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div>
                        <h2>திருப்புகழ்</h2>
                        <br>
                        <h3>சோடிழந்த அன்றினைப் போல் துயரமானேன்</h3>
                        <h3>தோகை மணில் வாயில் அகப்பட்ட சர்ப்பமானேன்</h3>
                        <h3>காடுகளில் இனம் பிரிந்த கல களானேன்</h3>
                        <h3>கருங் கடலிற் காற்றடிக்கும் கப்பலானேன்</h3>
                        <h3>ஓடுகின்ற பாய் மரத்தினல் காகமானேன்</h3>
                        <h3>உள்ளார் ஒருவரில்லாப் பித்தனானேன்</h3>
                        <h3>பாடுபட நானறியேன் பழனி வேலா</h3>
                        <h3>பச்சை மயில் மீது வந்து இரட்சிப்பாயே.</h3>
                    </div>
                    <br>
                    <div>
                        <h2>திருமந்திரம்</h2>
                        <br>
                        <h3>உடம்பினை முன்னம் இழுக்கு என்று இருந்தேன்</h3>
                        <h3>உடம்பினுக்கு உள்ளே உறுபொருள் கண்டேன்</h3>
                        <h3>உடம்புளே உத்தமன் கோயில்கொண்டான் என்று</h3>
                        <h3>உடம்பினை யான் இருந்து ஓம்புகின்றேனே.</h3>
                    </div>
                    <br>
                    <div>
                        <h2>வாழ்த்து</h2>
                        <br>
                        <h3>வான்முகில் வழாது பெய்க மலிவளஞ்சுரக்க மன்னன்</h3>
                        <h3>கோன்முறை அரசு செய்க குறைவிலாதுயிர்கள் வாழ்க</h3>
                        <h3>நான்மறை அறங்கள் ஓங்க நற்றவம் வேள்வி மல்க</h3>
                        <h3>மேன்மை கொள் சைவநீதி விளங்குக உலகமெல்லாம்.</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 310px;">
                    </div>
                    <h3>3</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <br>
                    <div class="left-align">
                        <h2 style="margin-left: 100px;">சிவபுராணம்</h2>
                        <br>
                        <h3>நமச்சிவாய வாழ்க நாதன் தாள்வாழ்க</h3>
                        <h3>இமைப்பொழுதும் என் நெஞ்சில், நீங்காதான் தாள்வாழ்க</h3>
                        <h3>கோகழி ஆண்ட குருமணிதன் தாள்வாழ்க</h3>
                        <h3>ஆகமம் ஆகிநின்று, அண்ணிப்பான் தாள்வாழ்க</h3>
                        <h3>ஏகன் அநேகன், இறைவன் அடிவாழ்க</h3>
                        <br>
                        <h3>வேகம் கெடுத்தாண்ட, வேந்தன் அடிவெல்க</h3>
                        <h3>பிறப்பறுக்கும் பிஞ்ஞகன்தன், பெய்கழல்கள் வெல்க</h3>
                        <h3>புறத்தார்க்குச் சேயோன்தன், பூங்கழல்கள் வெல்க</h3>
                        <h3>கரங்குவிவார் உள்மகிழும், கோன்கழல்கள் வெல்க</h3>
                        <h3>சிரங்குவிவார் ஓங்குவிக்கும், சீரோன் கழல்வெல்க</h3>
                        <br>
                        <h3>ஈசன் அடிபோற்றி, எந்தை அடிபோற்றி</h3>
                        <h3>தேசன் அடிபோற்றி, சிவன் சேவடிபோற்றி</h3>
                        <h3>நேயத்தே நின்ற நிமலன் அடிபோற்றி</h3>
                        <h3>மாயப் பிறப்பறுக்கும், மன்னன் அடிபோற்றி</h3>
                        <h3>சீரார் பெருந்துறை, நம் தேவன் அடிபோற்றி</h3>
                        <h3>ஆராத இன்பம், அருளும் மலைபோற்றி</h3>
                        <br>
                        <h3>சிவன் அவன் என்சிந்தையுள், நின்ற அதனால்</h3>
                        <h3>அவன் அருளாலே, அவன்தாள் வணங்கிச்</h3>
                        <h3>சிந்தை மகிழச் சிவபுராணந் தன்னை</h3>
                        <h3>முந்தை வினை முழுதும், ஓய உரைப்பன்யான்</h3>
                        <h3>கண்நுதலான் தன்கருணைக் கண்காட்ட வந்தெய்தி</h3>
                        <h3>எண்ணுதற்கு எட்டா எழிலார் கழல்இறைஞ்சி</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 200px;">
                    </div>
                    <h3>4</h3>
            </div>
            <br>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align">
                        <h3>விண்நிறைந்து மண்நிறைந்து, மிக்காய், விளங்கொளியாய்</h3>
                        <h3>எண்இறந்து எல்லை இலாதானே நின்பெருஞ்சீர்</h3>
                        <h3>பொல்லா வினையேன், புகழுமாறு ஒன்றறியேன்</h3>
                        <h3>புல்லாகிப் பூடாய்ப் புழுவாய் மரமாகிப்</h3>
                        <h3>பல்விருகம் ஆகிப் பறவையாய்ப் பாம்பாகிக்</h3>
                        <h3>கல்லாய் மனிதராய்ப் பேயாய்க் கணங்களாய்</h3>
                        <h3>வல்அசுரர் ஆகி, முனிவராய்த் தேவராய்ச்</h3>
                        <h3>செல்லா நின்ற, இத்தாவர சங்கமந்துள்</h3>
                        <h3>எல்லாப் பிறப்பும், பிறந்திளைத்தேன் எம்பெருமான்</h3>
                        <h3>மெய்யேஉன் பொன்னடிகள், கண்டுஇன்று வீடுற்றேன்</h3>
                        <h3>உய்யஎன் உள்ளத்துள், ஓங்காரமாய் நின்ற</h3>
                        <h3>மெய்யா விமலா, விடைப்பாகா வேதங்கள்</h3>
                        <h3>ஐயா எனஓங்கி, ஆழ்ந்தகன்ற நுண்ணியனே</h3>
                        <h3>வெய்யாய் தணியாய், இயமானன் ஆம்விமலா</h3>
                        <br>
                        <h3>பொய்யாயின எல்லாம், போய் அகல வந்தருளி</h3>
                        <h3>மெய்ஞ்ஞானம் ஆகி, மிளிர்கின்ற மெய்ச்சுடரே</h3>
                        <h3>எஞ்ஞானம் இல்லாதேன், இன்பப் பெருமானே</h3>
                        <h3>அஞ்ஞானம் தன்னை, அகல்விக்கும் நல்லறிவே</h3>
                        <h3>ஆக்கம், அளவிறுதி, இல்லாய், அனைத்துலகும்</h3>
                        <h3>ஆக்குவாய் காப்பாய், அழிப்பாய் அருள்தருவாய்</h3>
                        <h3>போக்குவாய் என்னைப் புகுவிப்பாய் நின்தொழும்பின்</h3>
                        <h3>நாற்றத்தின் நேரியாய், சேயாய் நணியானே</h3>
                        <h3>மாற்றம் மனங்கழிய, நின்ற மறையோனே</h3>
                        <br>
                        <h3>கறந்தபால் கன்னலொடு, நெய் கலந்தாற்போலச்</h3>
                        <h3>சிறந்தடியார் சிந்தனையுள், தேன்ஊறி நின்று</h3>
                        <h3>பிறந்த பிறப்பறுக்கும், எங்கள் பெருமான்</h3>
                        <h3>நிறங்கள் ஓர் ஐந்துடையாய், விண்ணோர்கள் ஏத்த</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 135px;">
                    </div>
                    <h3>5</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <div class="left-align">
                        <br>
                        <h3>மறைந்திருந்தாய் எம்பெருமான், வல்வினையேன் தன்னை</h3>
                        <h3>மறைந்திட மூடிய, மாய இருளை</h3>
                        <h3>அறம்பாவம் என்னும், அருங்கயிற்றால் கட்டிப்</h3>
                        <h3>புறந்தோல்போர்த் தெங்கும், புழுஅழுக்கு மூடி</h3>
                        <h3>மலஞ்சோரும் ஒன்பது, வாயில் குடிலை</h3>
                        <h3>மலங்கப் புலனைந்தும், வஞ்சனையைச் செய்ய</h3>
                        <h3>விலங்கு மனத்தால், விமலா உனக்குக்</h3>
                        <h3>கலந்தஅன்பு ஆகிக், கசிந்துள் உருகும்</h3>
                        <h3>நலந்தான் இலாத, சிறியேற்கு நல்கி</h3>
                        <h3>நிலந்தன்மேல் வந்தருளி, நீள்கழல்கள் காட்டி</h3>
                        <h3>நாயிற் கடையாய்க், கிடந்த அடியேற்குத்</h3>
                        <h3>தாயிற் சிறந்த, தயாவான தத்துவனே</h3>
                        <h3>மாசற்ற சோதி, மலர்ந்த மலர்ச்சுடரே</h3>
                        <h3>தேசனே தேனார், அமுதே சிவபுரனே</h3>
                        <h3>பாசமாம் பற்றறுத்துப், பாரிக்கும் ஆரியனே</h3>
                        <h3>நேச அருள்புரிந்து, நெஞ்சில் வஞ்சங்கெடப்</h3>
                        <h3>பேராது நின்ற, பெருங்கருணைப் பேராறே</h3>
                        <h3>ஆரா அமுதே, அளவிலாப் பெம்மானே</h3>
                        <h3>ஓராதார் உள்ளத்து, ஒளிக்கும் ஒளியானே</h3>
                        <h3>நீராய் உருக்கி என் ஆருயிராய் நின்றானே</h3>
                        <h3>இன்பமும் துன்பமும், இல்லானே உள்ளானே</h3>
                        <h3>அன்பருக்கு அன்பனே, யாவையுமாய் அல்லையுமாம்</h3>
                        <h3>சோதியனேதுன்இருளே, தோன்றாப் பெருமையனே</h3>
                        <h3>ஆதியனே அந்தம் நடுவாகி அல்லானே</h3>
                        <h3>ஈர்த்தென்னை ஆட்கொண்ட எந்தை பெருமானே</h3>
                        <h3>கூர்த்தமெஞ் ஞானத்தால் கொண்டுணர்வார் தங்கருத்தின்</h3>
                        <h3>நோக்கரிய நோக்கே, நுணுக்கரிய நுண்உணர்வே</h3>
                        <h3>போக்கும் வரவும், புணர்வும்இலாப் புண்ணியனே</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 180px;">
                    </div>
                    <h3>6</h3>
            </div>
            <br>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align">
                        <h3>காக்கும் எம்காவலனே, காண்பரிய பேர்ஒளியே</h3>
                        <h3>ஆற்றின்ப வெள்ளமே, அத்தா மிக்காய்நின்ற</h3>
                        <h3>தோற்றச் சுடர்ஒளியாய்ச், சொல்லாத நுண்உணர்வாய்</h3>
                        <br>
                        <h3>மாற்றமாம் வையகத்தின், வெவ்வேறே வந்தறிவாம்</h3>
                        <h3>தேற்றனே தேற்றத் தெளிவே என்சிந்தனையுள்</h3>
                        <h3>ஊற்றான உண்ணார், அமுதே உடையானே</h3>
                        <h3>வேற்று விகார, விடக்குடம்பின் உள்கிடப்ப</h3>
                        <h3>ஆற்றேன் எம் ஐயா, அரனேயோ என்றென்று</h3>
                        <h3>போற்றிப் புகழ்ந்திருந்து, பொய்கெட்டு மெய்யானார்</h3>
                        <h3>மீட்டிங்கு வந்து, வினைப்பிறவி சாராமே</h3>
                        <h3>கள்ளப் புலக்குரம்பைக், கட்டழிக்க வல்லானே</h3>
                        <h3>நள்இருளில் நட்டம், பயின்றாடும் நாதனே</h3>
                        <h3>தில்லையுள் கூத்தனே, தென்பாண்டி நாட்டானே</h3>
                        <h3>அல்லல் பிறவி, அறுப்பானே ஓ என்று</h3>
                        <h3>சொல்லற்கு அரியானைச், சொல்லித் திருவடிக்கீழ்ச்</h3>
                        <h3>சொல்லிய பாட்டின், பொருளுணர்ந்து சொல்லுவார்</h3>
                        <h3>செல்வர் சிவபுரத்தின், உள்ளார் சிவனடிக்கீழ்ப்</h3>
                        <h3>பல்லோரும் ஏத்தப் பணிந்து.</h3>
                        <br>
                        <h3 style="margin-left: 130px;">திருச்சிற்றம்பலம்.</h3>
                        <br>
                        <div>
                            <h2 class="center-align">திருப்பொற்சுண்ணம்</h2>
                            <br>
                            <h3>திருப்பொற் சுண்ணம் - ஆனந்த மனோலயம்</h3>
                            <h3>(தில்லையில் அருளியது - அறுசீர் ஆசிரிய விருத்தம்)</h3>
                            <div style="margin-left: 50px;">
                                <br>
                                <h3>முத்துநல் தாழம்பூ மாலைதூக்கி</h3>
                                <h3>முளைக்குடந் தூபம்நல் தீபம்வைம்மின்</h3>
                                <h3>சக்தியும் சோமியும் பார்மகளும்</h3>
                                <h3>நாமகளோடுபல்லாண்டிசைமின்</h3>
                            </div>
                        </div>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 75px;">
                    </div>
                    <h3>7</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <br>
                    <div class="left-align-large">
                        <h3>சித்தியுங் கௌரியும் பார்ப்பதியும்</h3>
                        <h3>கங்கையும் வந்து கவரிகொண்மின்</h3>
                        <h3>அத்தன் ஐயாறன்அம்மானைபாடி</h3>
                        <h3>ஆடப்பொற் சுண்ணம் இடித்துநாமே.</h3>
                        <br>
                        <h3>பூவியல் வார்சடை எம்பிராற்குப்</h3>
                        <h3>பொற்றிருச் சுண்ணம் இடிக்கவேண்டும்</h3>
                        <h3>மாவின் வடுவகி ரன்ன கண்ணீர்</h3>
                        <h3>வம்மின்கள் வந்துடன் பாடுமின்கள்</h3>
                        <h3>கூவுமின் தொண்டர் புறநிலாமே</h3>
                        <h3>குனிமின் தொழுமினெங் கோனெங்கூத்தன்</h3>
                        <h3>தேவியுந் தானும்வந்தெம்மையாளச்</h3>
                        <h3>செம்பொன்செய் சுண்ணம் இடித்துநாமே.</h3>
                        <br>
                        <h3>சுந்தர நீறணந் தும்மெழுகித்</h3>
                        <h3>தூயபொன்சிந்தி நிதிநிரப்பி</h3>
                        <h3>இந்திரன் கற்பகம் நாட்டியெங்கும்</h3>
                        <h3>எழிற்சுடர் வைத்துக் கொடியெடுமின்</h3>
                        <h3>அந்தார் கோன்அயன் தன்பெருமான்</h3>
                        <h3>ஆழியான் நாதன்நல் வேலன்தாதை</h3>
                        <h3>எந்தரம் ஆளுமை யாள்கொழுநற்</h3>
                        <h3>கேய்ந்த பொற்சுண்ணம் இடித்துநாமே.</h3>
                        <br>
                        <h3>காசணி மின்கள் உலக்கையெல்லாம்</h3>
                        <h3>காம்பணி மின்கள் கறையுரலை</h3>
                        <h3>நேசமுடைய அடியவர்கள்</h3>
                        <h3>நின்று நிலாவுக என்றுவாழ்த்தித்</h3>
                        <h3>தேசமெல்லாம் புகழ்ந் தாடுங் கச்சித்</h3>
                        <h3>திருவேகம் பன்செம்பொற் கோயில்பாடிப்</h3>
                        <h3>பாசவினையைப் பறிந்துநின்று</h3>
                        <h3>பாடிப் பொற்சுண்ணம் இடித்துநாமே.</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 80px;">
                    </div>
                    <h3>8</h3>
            </div>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align-large">
                        <h3>அறுகெடுப்பார் அயனும்அரியும்</h3>
                        <h3>அன்றிமற்றிந்திர னோடமரர்</h3>
                        <h3>நறுமுது தேவர்கணங்கெளெல்லாம்</h3>
                        <h3>நம்மிற்பின் பல்லதெடுக்க வொட்டோ ம்</h3>
                        <h3>செறிவுடை மும்மதில் எய்தவில்லி</h3>
                        <h3>திருவேகம் பன்செம்பொற் கோயில்பாடி</h3>
                        <h3>முறுவற்செவ் வாயினீர் முக்கணப்பற்</h3>
                        <h3>காடப்பொற்சுண்ணம் இடித்துநாமே.</h3>
                        <br>
                        <h3>உலக்கை பலஒச்சு வார்பெரியர்</h3>
                        <h3>உலகமெலாம்உரல் போதாதென்றே</h3>
                        <h3>கலக்க அடியவர் வந்துநின்றார்</h3>
                        <h3>காண உலகங்கள் போதாதென்றே</h3>
                        <h3>நலக்க அடியோமை ஆண்டுகொண்டு</h3>
                        <h3>நாண்மலர்ப் பாதங்கள் சூடந்தந்த</h3>
                        <h3>மலைக்கு மருகனைப் பாடிப்பாடி மகிழந்து</h3>
                        <h3>பொற்சுண்ணம் இடிந்தும்நாமே.</h3>
                        <br>
                        <h3>சூடகந் தோள்வரை ஆர்ப்ப ஆர்ப்பத்</h3>
                        <h3>தொண்டர் குழாமெழுந் தார்ப்ப ஆர்ப்ப</h3>
                        <h3>நாடவர் நந்தம்மை ஆர்ப்ப ஆர்ப்ப</h3>
                        <h3>நாமும் அவர்தம்மை ஆர்ப்ப ஆர்ப்பப்</h3>
                        <h3>பாடக மெல்லடி யார்க்கு மங்கை</h3>
                        <h3>பங்கினன் எங்கள் பராபரனுக்கு</h3>
                        <h3>ஆடக மாமலை அன்னகோவுக்</h3>
                        <h3>காடப் பொற்சுண்ணம் இடித்தும்நாமே.</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 250px;">
                    </div>
                    <h3>9</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <br>
                    <div class="left-align-large">
                        <h3>வாள்தடங்கண்மட மங்கைநல்லீர்</h3>
                        <h3>வரிவளை ஆர்ப்பவண் கொங்கைபொங்கத்</h3>
                        <h3>தோள்திரு முண்டந் துதைந்திலங்கச்</h3>
                        <h3>சோத்தெம்பி ரானென்று சொல்லிச்சொல்லி</h3>
                        <h3>நாட்கோண்ட நாண்மலர்ந் பாதங்காட்டி</h3>
                        <h3>நாயிற் கடைப்பட்ட நம்மையிம்மை</h3>
                        <h3>ஆட்கொண்ட வண்ணங்கள் பாடிப்பாடி</h3>
                        <h3>ஆடப் பொற்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>வையகம் எல்லாம் உரலதாக</h3>
                        <h3>மாமேரு என்னும் உலக்கை நாட்டி</h3>
                        <h3>மெய்யனும் மஞ்சள் நிறைய அட்டி</h3>
                        <h3>மேதரு தென்னன் பெருந்துறையான்</h3>
                        <h3>செய்ய திருவடி பாடிப்பாடிச்</h3>
                        <h3>செம்பொன் உலக்கை வலக்கைபற்றி</h3>
                        <h3>ஐயன் அணிதில்லை வாணனுக்கே</h3>
                        <h3>ஆடப்பொற்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>முத்தணி கொங்கைகள் ஆடஆட</h3>
                        <h3>மொய்குழல் வண்டினம் ஆடஆடச்</h3>
                        <h3>சித்தஞ் சிவனொடும் ஆடஆடச்</h3>
                        <h3>செங்கயற் கண்பனி ஆடஆடப்</h3>
                        <h3>பித்தெம் பிரானொடும் ஆடஆடப்</h3>
                        <h3>பிறவி பிறரொடும் ஆடஆட</h3>
                        <h3>அத்தன் கருணையொ டாடஆட</h3>
                        <h3>ஆடப்பொற்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>மாடு நகைவாள் நிலாவெறிப்ப</h3>
                        <h3>வாய்திறந் தம்பவ ளந்துடிப்பப்</h3>
                        <h3>பாடுமின் நந்தம்மை ஆண்டவாறும்</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 125px;">
                    </div>
                    <h3>10</h3>
            </div>
            <br>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align-large">
                        <h3>பணிகொண்ட வண்ணமும் பாடிப்பாடித்</h3>
                        <h3>தேடுமின் எம்பெருமானைத்தேடி</h3>
                        <h3>சித்தங் களிப்பத் திகைத்துத்தேறி</h3>
                        <h3>ஆடுமின் அம்பலத் தாடினானுக்</h3>
                        <h3>காடப்பொற்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>மையமர் கண்டனை வானநாடர்</h3>
                        <h3>மருந்தினை மாணிக்கக் கூத்தன்தன்னை</h3>
                        <h3>ஐயனை ஐயர்பிரானைநம்மை</h3>
                        <h3>அகப்படுத் தாட்கொண் டருமைகாட்டும்</h3>
                        <h3>பொய்யர் தம் பொய்யனை மெய்யர் மெய்யைப்</h3>
                        <h3>போதரிக் கண்ணினைப் பொற்றொடித்தோள்</h3>
                        <h3>பையர வல்குல் மடந்தைநல்லீர்</h3>
                        <h3>பாடிப் பொற்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>மின்னிடைச் செந்துவர் வாய்க்கருங்கண்</h3>
                        <h3>வெண்ணகைப் பண்ணமர் மென்மொழியீர்</h3>
                        <h3>என்னுடை ஆரமுதெங்களப்பன்</h3>
                        <h3>எம்பெருமான் இம வான்மகட்குத்</h3>
                        <h3>தன்னுடைக் கேள்வன் மகன்தகப்பன்</h3>
                        <h3>தமையன்எம் ஐயன் தாள்கள் பாடிப்</h3>
                        <h3>பொன்னுடைப் பூண்முலை மங்கைநல்லீர்</h3>
                        <h3>பொற்றிருச்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>சங்கம் அரற்றச் சிலம்பொலிப்பத்</h3>
                        <h3>தாழ்குழல் சூழ்தரு மாலையாடச்</h3>
                        <h3>செங்கனி வாயிதழுந்துடிப்பச்</h3>
                        <h3>சேயிழை யீர் சிவலோகம் பாடிக்</h3>
                        <h3>கங்கை இரைப்ப அராஇரைக்குங்</h3>
                        <h3>கற்றைச் சடைமுடி யான்கழற்கே</h3>
                        <h3>பொங்கிய காதலிற் கொங்கை பொங்கப்</h3>
                        <h3>பொற்றிருச்சுண்ணம் இடித்தும்நாமே.</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 50px;">
                    </div>
                    <h3>11</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <br>
                    <div class="left-align-large">
                        <h3>ஞானக் கரும்பின் தெளியைப் பாகை</h3>
                        <h3>நாடற் கரிய நலத்தை நந்தாத்</h3>
                        <h3>தேனைப் பழச்சுவை ஆயினானைச்</h3>
                        <h3>சித்தம் புகுந்துதித் திக்கவல்ல</h3>
                        <h3>கோனைப் பிறப்பறுத் தாண்டுகொண்ட</h3>
                        <h3>கூத்தனை நாத்தழும் பேறவாழ்த்திப்</h3>
                        <h3>பானல் தடங்கண் மடந்தைநல்லீர்</h3>
                        <h3>பாடிப்பொற்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>ஆவகை நாமும் வந்தன்பர்தம்போ</h3>
                        <h3>டாட்செய்யும் வண்ணங்கள் பாடிவிண்மேல்</h3>
                        <h3>தேவர் கனாவிலுங் கண்டறியாச்</h3>
                        <h3>செம்மலர்ப் பாதங்கள் காட்டுஞ் செல்வச்</h3>
                        <h3>சேவகம் ஏந்திய வெல்கொடியான்</h3>
                        <h3>சிவபெரு மான் புரஞ் செற்றகொற்றச்</h3>
                        <h3>சேவகன் நாமங்கள் பாடிப்பாடிச்</h3>
                        <h3>செம்பொன் செய்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>தேனக மாமலர்க் கொன்றைபாடிச்</h3>
                        <h3>சிவபுரம் பாடித் திருச்சடைமேன்</h3>
                        <h3>வானக மாமதிப் பிள்ளைபாடி</h3>
                        <h3>மால்விடை பாடி வலக்கையேந்தும்</h3>
                        <h3>ஊனக மாமழுச் சூலம்பாடி</h3>
                        <h3>உம்பரும் இம்பரும் உய்யஅன்று</h3>
                        <h3>போனக மாகநஞ் சுண்டல்பாடிப்</h3>
                        <h3>பொற்றிச்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>அயன்தலை கொண்டுசெண்டாடல்பாடி</h3>
                        <h3>அருக்கன் எயிறு பறித்தல்பாடி</h3>
                        <h3>கயந்தனைக் கொன்றுரி போர்த்தல் பாடிக்</h3>
                        <h3>காலனைக்காலால் உதைத்தல்பாடி</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 100px;">
                    </div>
                    <h3>12</h3>
            </div>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align-large">
                        <h3>இயைந்தன முப்புரம் எய்தல் பாடி</h3>
                        <h3>ஏழை அடியோமை ஆண்டுகொண்ட</h3>
                        <h3>நயந்தனைப் பாடிநின் றாடியாடி</h3>
                        <h3>நாதற்குச் சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>வட்டமலர்க்கொன்றை மாலைபாடி</h3>
                        <h3>மத்தமும்பாடி மதியம்பாடிச்</h3>
                        <h3>சிட்டர்கள் வாழுந்தென் தில்லைபாடிச்</h3>
                        <h3>சிற்றம் பலத்தெங்கள் செல்வம்பாடிக்</h3>
                        <h3>கட்டிய மாசுணக்கச்சைப் பாடிக்</h3>
                        <h3>கங்கணம் பாடிக் கவித்தகைம்மேல்</h3>
                        <h3>இட்டுநின் றாடும் அரவம்பாடி</h3>
                        <h3>ஈசற்குச்சுண்ணம் இடித்தும்நாமே.</h3>
                        <br>
                        <h3>வேதமும் வேள்வியும் ஆயினார்க்கு</h3>
                        <h3>மெய்ம்மையும் பொய்ம்மையும் ஆயினார்க்குச்</h3>
                        <h3>சோதிய மாய் இருள் ஆயினார்க்குத்</h3>
                        <h3>துன்பமுமாய் இன்பம் ஆயினார்க்குப்</h3>
                        <h3>பாதியு மாய் முற்றும் ஆயினார்க்குப்</h3>
                        <h3>பந்தமு மாய் வீடும் ஆயினார்க்கு</h3>
                        <h3>ஆதியும் அந்தமும் ஆயினார்க்கு</h3>
                        <h3>ஆடப்பொற்சுண்ணம் இடித்தும்நாமே.</h3>
                    </div>
                    <br>
                    <div style="border-bottom: 1px solid #000; margin-top: 340px;">
                    </div>
                    <h3>13</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <br>
                    <br>
                    <h3>திருச்சிற்றம்பலம்</h3>
                    <br>
                    <h2>கந்தர் சஷ்டி கவசம் காப்பு</h2>
                    <br>
                    <div class="left-align">
                        <h3>காப்பு</h3>
                        <br>
                        <h3>துதிப்போர்க்கு வல்வினை போம்; துன்பம்போம்; நெஞ்சில்</h3>
                        <h3>பதிப்போர்க்குச் செல்வம் பலித்துக்-கதித்தோங்கும்</h3>
                        <h3>நிஷ்டையுங் கைகூடும், நிமலரருள் கந்தர்</h3>
                        <h3>சஷ்டி கவசம் தனை.</h3>
                        <br>
                        <h3>அமர ரிடர்தீர அமரம் புரிந்த</h3>
                        <h3>குமரனடி நெஞ்சே குறி</h3>
                        <br>
                        <h3>நூல்</h3>
                        <br>
                        <h3>சஷ்டியை நோக்கச் சரவண பவனார்</h3>
                        <h3>சிஷ்டருக் குதவும் செங்கதிர் வேலோன்</h3>
                        <h3>பாதம் இரண்டில் பன்மணிச் சதங்கை</h3>
                        <h3>கீதம் பாடக் கிண்கிணி யாட</h3>
                        <br>
                        <h3>மையல் நடனஞ்செய்யும் மயில்வா கனனார்</h3>
                        <h3>கையில் வேலால் எனைக் காக்கவென் றுவந்து</h3>
                        <h3>வரவர வேலா யுதனார் வருக</h3>
                        <h3>வருக வருக மயிலோன் வருக</h3>
                        <br>
                        <h3>இந்திரன் முதலா எண்டிசை போற்ற</h3>
                        <h3>மந்திர வடிவேல் வருக வருக!</h3>
                        <h3>வாசவன் மருகா வருக வருக</h3>
                        <h3>நேசக் குறமகள் நினைவோன் வருக</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000; margin-top: 120px;">
                    </div>
                    <h3>14</h3>
            </div>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align">
                        <h3>ஆறுமுகம் படைத்த ஐயா வருக</h3>
                        <h3>நீறிடும் வேலவன் நித்தம் வருக</h3>
                        <h3>சிரகிரி வேலவன் சீக்கிரம் வருக!</h3>
                        <h3>சரவண பவனார் சடுதியில் வருக</h3>
                        <br>
                        <h3>ரவண பவச ர ர ர ர ர ர ர</h3>
                        <h3>ரிவண பவச ரி ரி ரி ரி ரி ரி ரி</h3>
                        <h3>விநபவ சரவண வீரா நமோநம</h3>
                        <h3>நிபவ சரவண நிறநிற நிறென</h3>
                        <br>
                        <h3>வசுர வணப வருக வருக</h3>
                        <h3>அசுரர் குடிகெடுத்த ஐயா வருக</h3>
                        <h3>என்னை ஆளும் இளையோன் கையில்</h3>
                        <h3>பன்னிரண் டாயுதம் பாசாங் குசமும்</h3>
                        <br>
                        <h3>பரந்த விழிகள் பன்னிரண் டிலங்க</h3>
                        <h3>விரைந்தெனைக் காக்க வேலோன் வருக</h3>
                        <h3>ஐயும் கிலியும் அடைவுடன் சவ்வும்</h3>
                        <h3>உய்யொளி சௌவும் உயிரைங் கிலியும்</h3>
                        <br>
                        <h3>கிலியுஞ் சௌவும் கிளரொளி யையும்</h3>
                        <h3>நிலைபெற் றென்முன் நித்தமும் ஒளிரும்</h3>
                        <h3>சண்முகன் நீயும் தனியொளி யொவ்வும்</h3>
                        <h3>குண்டலி யாஞ்சிவ குகன் தினம் வருக!</h3>
                        <br>
                        <h3>ஆறு முகமும் அணிமுடி ஆறும்</h3>
                        <h3>நீறிடு நெற்றியில் நீண்ட புருவமும்</h3>
                        <h3>பன்னிரு கண்ணும் பவளச்செவ் வாயும்</h3>
                        <h3>நன்னெறி நெற்றியில் நவமணிச் சுட்டியும்</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000;margin-top: 150px;">
                    </div>
                    <h3>15</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <br>
                    <div class="left-align">
                        <h3>ஈராறு செவியில் இலகுகுண் டலமும்</h3>
                        <h3>ஆறிரு திண்புயத் தழகிய மார்பில்</h3>
                        <h3>பல்பூ ஷணமும் பதக்கமும் தரித்து</h3>
                        <h3>நன்மணி பூண்ட நவரத்ன மாலையும்</h3>
                        <br>
                        <h3>முப்புரி நூலும் முத்தணி மார்பும்</h3>
                        <h3>செப்பழ குடைய திருவயி றுந்தியும்</h3>
                        <h3>துவண்ட மருங்கில் சுடரொளிப் பட்டும்</h3>
                        <h3>நவரத்தினம் பதித்த நற்சீ ராவும்</h3>
                        <br>
                        <h3>இருதொடை யழகும் இணைமுழந் தாளும்</h3>
                        <h3>திருவடி யதனில் சிலம்பொலி முழங்க</h3>
                        <h3>செககண செககண செககண செகண</h3>
                        <h3>மொகமொக மொகமொக மொகமொக மொகென</h3>
                        <br>
                        <h3>நகநக நகநக நகநக நகென</h3>
                        <h3>டிகுகுண டிகுடிகு டிகுகுண டிகுண</h3>
                        <h3>ரரரர ரரரர ரரரர ரரர</h3>
                        <h3>ரிரிரிரி ரிரிரிரி ரிரிரிரி ரிரிரி</h3>
                        <br>
                        <h3>டுடுடுடு டுடுடுடு டுடுடுடு டுடுடு</h3>
                        <h3>டகுடகு டிகுடிகு டங்கு டிங்குகு</h3>
                        <h3>விந்து விந்து மயிலோன் விந்து</h3>
                        <h3>முந்து முந்து முருகவேள் முந்து</h3>
                        <br>
                        <h3>என்றனை யாளும் ஏரகச் செல்வ</h3>
                        <h3>மைந்தன் வேண்டும் வரமகிழ்ந் துதவும்</h3>
                        <h3>லாலா லாலா லாலா வேசமும்</h3>
                        <h3>லீலா லீலா லீலா வினோ தனென்று</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000;margin-top: 160px;">
                    </div>
                    <h3>16</h3>
            </div>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align">
                        <h3>உன் திருவடியை உறுதியென் றெண்ணும்</h3>
                        <h3>எந்தலை வைத்துன் இணையடி காக்க</h3>
                        <h3>என்னுயிர்க் குயிராம் இறைவன் காக்க</h3>
                        <h3>பன்னிரு விழியால் பாலனைக் காக்க</h3>
                        <br>
                        <h3>அடியேன் வதனம் அழகுவேல் காக்க</h3>
                        <h3>பொடிபுனை நெற்றியைப் புனிதவேல் காக்க</h3>
                        <h3>கதிர்வேல் இரண்டும் கண்ணினைக் காக்க</h3>
                        <h3>விதிசெவி இரண்டும் வேலவர் காக்க</h3>
                        <br>
                        <h3>நாசிகளி ரண்டும் நல்வேல் காக்க</h3>
                        <h3>பேசிய வாய்தனைப் பெருவேல் காக்க</h3>
                        <h3>முப்பத் திருபல் முனைவேல் காக்க</h3>
                        <h3>செப்பிய நாவைச் செவ்வேல் காக்க</h3>
                        <br>
                        <h3>கன்னமி ரண்டும் கதிர்வேல் காக்க</h3>
                        <h3>என்னிளங் கழுத்தை இனியவேல் காக்க</h3>
                        <h3>மார்பை ரத்ன வடிவேல் காக்க</h3>
                        <h3>சேரிள முலைமார் திருவேல் காக்க</h3>
                        <br>
                        <h3>வடிவே லிருதோள் வளம்பெறக் காக்க</h3>
                        <h3>பிடரிக ளிடண்டும் பெருவேல் காக்க</h3>
                        <h3>அழகுடன் முதுகை அருள்வேல் காக்க</h3>
                        <h3>பழுபதி னாறும் பருவேல் காக்க</h3>
                        <br>
                        <h3>வெற்றிவேல் வயிற்றை விளங்கவே காக்க</h3>
                        <h3>சிற்றிடை யழகுறச் செவ்வேல் காக்க</h3>
                        <h3>நாணாங் கயிற்றை நல்வேல் காக்க</h3>
                        <h3>ஆண்குறி யிரண்டும் அயில்வேல் காக்க</h3>
                        <h3>பிட்ட மிரண்டும் பெருவேல் காக்க</h3>
                        <h3>பணைத் தொடை இரண்டும் பருவேல் காக்க</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000;margin-top: 95px;">
                    </div>
                    <h3>17</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <div class="left-align">
                        <h3>கணைக்கால் முழந்தாள் கதிர்வேல் காக்க</h3>
                        <h3>வட்டக் குதத்தை வல்வேல் காக்க</h3>
                        <h3>ஐவிரல் அடியினை அருள்வேல் காக்க</h3>
                        <h3>கைகளி ரண்டும் கருணைவேல் காக்க</h3>
                        <br>
                        <h3>முன்கையி ரண்டும் முரண்வேல் காக்க</h3>
                        <h3>பின்கையி ரண்டும் பின்னவள் இருக்க</h3>
                        <h3>நாவில் சரஸ்வதி நற்றுணை யாக</h3>
                        <h3>நாபிக் கமலம் நல்வேல் காக்க</h3>
                        <h3>முப்பால் நாடியை முனைவேல் காக்க</h3>
                        <br>
                        <h3>எப்பொழு தும்எனை எதிர்வேல் காக்க</h3>
                        <h3>அடியேன் வதனம் அசைவுள நேரம்</h3>
                        <h3>கடுகவே வந்து கனகவேல் காக்க</h3>
                        <h3>வரும்பகல் தன்னில் வச்சிரவேல் காக்க</h3>
                        <h3>அரையிருள் தன்னில் அனையவேல் காக்க</h3>
                        <br>
                        <h3>ஏமத்தில் சாமத்தில் எதிர்வேல் காக்க</h3>
                        <h3>தாமதம் நீக்கிச் சதுர்வேல் காக்க</h3>
                        <h3>காக்க காக்க கனகவேல் காக்க</h3>
                        <h3>நோக்க நோக்க நொடியில் நோக்க</h3>
                        <h3>தாக்க தாக்க தடையறக் தாக்க</h3>
                        <br>
                        <h3>பார்க்க பார்க்க பாவம் பொடிபட</h3>
                        <h3>பில்லி சூனியம் பெரும்பகை அகல</h3>
                        <h3>வல்ல பூதம் வலாட்டிகப் பேய்கள்</h3>
                        <h3>அல்லற் படுத்தும் அடங்கா முனியும்</h3>
                        <h3>பிள்ளைகள் தின்னும் புழக்கடை முனியும்</h3>
                        <br>
                        <h3>கொள்ளிவாய்ப் பேய்களும், குறளைப் பேய்களும்</h3>
                        <h3>பெண்களைத் தொடரும் பிரமராட் சதரும்</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000;margin-top: 105px;">
                    </div>
                    <h3>18</h3>
            </div>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align">
                        <h3>அடியனைக் கண்டால் அலறிக் கலங்கிட</h3>
                        <h3>இரிசு காட்டேரி இத்துன்ப சேனையும்</h3>
                        <h3>எல்லிலும் இருட்டிலும் எதிர்ப்படும் அண்ணரும்</h3>
                        <br>
                        <h3>கனபூசை கொள்ளும் காளியோ டனைவரும்</h3>
                        <h3>விட்டாங் காரரும் மிகுபல பேய்களும்</h3>
                        <h3>தண்டியக் காரரும் சண்டாளர் களும்</h3>
                        <h3>என்பெயர் சொல்லவும் இடிவிழுந் தோடிட</h3>
                        <br>
                        <h3>ஆனை யடியினில் அரும்பா வைகளும்</h3>
                        <h3>பூனை மயிரும் பிள்ளைகள் என்பும்</h3>
                        <h3>நகமும் மயிரும் நீண்முடி மண்டையும்</h3>
                        <h3>பாவைக ளுடனே பலகல சத்துடன்</h3>
                        <br>
                        <h3>மனையிற் புதைத்த வஞ்சனை தனையும்</h3>
                        <h3>ஒட்டியச் செருக்கும் ஒட்டிய பாவையும்</h3>
                        <h3>காசும் பணமும் காவுடன் சோறும்</h3>
                        <h3>ஓதும் அஞ்சனமும் ஒருவழிப் போக்கும்</h3>
                        <br>
                        <h3>அடியனைக் கண்டால் அலைந்து குலைந்திட</h3>
                        <h3>மாற்றார் வஞ்சகர் வந்து வணங்கிட</h3>
                        <h3>காலதூ தாளெனைக் கண்டாற் கலங்கிட</h3>
                        <h3>அஞ்சி நடுங்கிட அரண்டு புரண்டிட</h3>
                        <br>
                        <h3>வாய்விட் டலறி மதிகெட் டோட</h3>
                        <h3>படியினில் முட்ட பாசக் கயிற்றால்</h3>
                        <h3>கட்டுடன் அங்கம் கதறிடக் கட்டு</h3>
                        <h3>கட்டி உருட்டு கைகால் முறிய</h3>
                        <br>
                        <h3>கட்டு கட்டு கதறிடக் கட்டு</h3>
                        <h3>முட்டு முட்டு விழிகள் பிதுங்கிட</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000;margin-top: 95px;">
                    </div>
                    <h3>19</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <br>
                    <div class="left-align">
                        <h3>செக்கு செக்கு செதில் செதிலாக</h3>
                        <h3>சொக்கு சொக்கு சூர்ப்பகைச் சொக்கு</h3>
                        <br>
                        <h3>குத்து குத்து கூர்வடி வேலால்</h3>
                        <h3>பற்று பற்று பகலவன் தணலெரி</h3>
                        <h3>தணலெரி தணலெரி தணலது வாக</h3>
                        <h3>விடு விடு வேலை வெகுண்டது வோடப்</h3>
                        <br>
                        <h3>புலியும் நரியும் புன்னரி நாயும்</h3>
                        <h3>எலியும் கரடியும் இனித் தொடர்ந் தோட</h3>
                        <h3>தேளும் பாம்பும் செய்யான் பூரான்</h3>
                        <h3>கடிவிட விஷங்கள் கடித்துய ரங்கம்</h3>
                        <br>
                        <h3>ஏறிய விஷங்கள் எளிதினில் இறங்க</h3>
                        <h3>ஒளிப்புஞ் சுளுக்கும் ஒருதலை நோயும்</h3>
                        <h3>வாதஞ் சயித்தியம் வலிப்புப் பித்தம்</h3>
                        <h3>குலைசயங் குன்மம் சொக்குச் சிரங்கு</h3>
                        <br>
                        <h3>குடைச்சல் சிலந்தி குடல்விப் புருதி</h3>
                        <h3>பக்கப் பிளவை படர்தொடை வாழை</h3>
                        <h3>கடுவன் படுவன் கைத்தாள் சிலந்தி</h3>
                        <h3>பற்குத் தரணை பருஅரை யாப்பும்</h3>
                        <br>
                        <h3>எல்லாப் பிணியும் என்றனைக் கண்டால்</h3>
                        <h3>நில்லா தோட நீஎனக் கருள்வாய்</h3>
                        <h3>ஈரேழு உலகமும் எனக் குறவாக</h3>
                        <h3>ஆணும் பெண்ணும் அனைவரும் எனக்கா</h3>
                        <br>
                        <h3>மண்ணா ளரசரும் மகிழ்ந்துற வாகவும்</h3>
                        <h3>உன்னைத் துதிக்க உன் திரு நாமம்</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000;margin-top: 125px;">
                    </div>
                    <h3>20</h3>
            </div>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align">
                        <h3>சரவண பவனே சைலொளி பவனே</h3>
                        <h3>திரிபுர பவனே திகழொளி பவனே</h3>
                        <br>
                        <h3>பரிபுர பவனே பவமொளி பவனே</h3>
                        <h3>அரிதிரு மருகா அமரா வதியைக்</h3>
                        <h3>காத்துத் தேவர்கள் கடும்சிறை விடுத்தாய்</h3>
                        <h3>கந்தா குகனே கதிர்வே லவனே</h3>
                        <br>
                        <h3>கார்த்திகை மைந்தா கடம்பா கடம்பனை</h3>
                        <h3>இடும்பனை யழித்த இனியவேல் முருகா</h3>
                        <h3>தனிகா சலனே சங்கரன் புதல்வா</h3>
                        <h3>கதிர்கா மத்துறை கதிர்வேல் முருகா</h3>
                        <br>
                        <h3>பழநிப் பதிவாழ் பாலகு மாரா</h3>
                        <h3>ஆவினன் குடிவாழ் அழகிய வேலா</h3>
                        <h3>செந்தின்மா மலையுறும் செங்கல்வ ராயா</h3>
                        <h3>சமரா புரிவாழ் சண்முகத் தரசே</h3>
                        <br>
                        <h3>காரார் குழலாள் கலைமகள் நன்றாய்</h3>
                        <h3>என்நா இருக்க யானுனைப் பாட</h3>
                        <h3>எனைத் தொடர்ந்திருக்கும் எந்தை முருகனைப்</h3>
                        <h3>பாடினேன் ஆடினேன் பரவச மாக</h3>
                        <br>
                        <h3>ஆடினேன் ஆடினேன் ஆவினன் பூதியை</h3>
                        <h3>நேச முடன்யான் நெற்றியில் அணிய</h3>
                        <h3>பாச வினைகள் பற்றது நீங்கி</h3>
                        <h3>உன்பதம் பெறவே உன்னரு ளாக</h3>
                        <br>
                        <h3>அன்புடன் இரட்சி அன்னமுஞ் சொன்னமும்</h3>
                        <h3>மெத்தமெத் தாக வேலா யுதனார்</h3>
                        <h3>சித்திபெற் றடியேன் சிறப்புடன் வாழ்க</h3>
                        <h3>வாழ்க வாழ்க மயிலோன் வாழ்க</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000;margin-top: 65px;">
                    </div>
                    <h3>21</h3>
            </div>
            <div class="static_page">
                <%= render 'header_two' %>
                    <br>
                    <div class="left-align">
                        <h3>வாழ்க வாழ்க வடிவேல் வாழ்க</h3>
                        <h3>வாழ்க வாழ்க மலைக்குரு வாழ்க</h3>
                        <h3>வாழ்க வாழ்க மலைக்குற மகளுடன்</h3>
                        <h3>வாழ்க வாழ்க வாரணத் துவசம்</h3>
                        <br>
                        <h3>வாழ்க வாழ்கஎன் வறுமைகள் நீங்க</h3>
                        <h3>எத்தனை குறைகள் எத்தனை பிழைகள்</h3>
                        <h3>எத்தனை அடியேன் எத்தனை செயினும்</h3>
                        <h3>பெற்றவன் நீகுரு பொறுப்பது உன்கடன்</h3>
                        <br>
                        <h3>பெற்றவள் குறமகள் பெற்றவ ளாமே</h3>
                        <h3>பிள்ளையென் றன்பாய்ப் பிரிய மளித்து</h3>
                        <h3>மைந்தனென் மீதுன் மனமகிழ்ந் தருளித்</h3>
                        <h3>தஞ்சமென் றடியார் தழைத்திட அருள்செய்</h3>
                        <br>
                        <h3>கந்தர் சஷ்டி கவசம் விரும்பிய</h3>
                        <h3>பாலன் தேவ ராயன் பகர்ந்ததைக்</h3>
                        <h3>காலையில் மாலையில் கருத்துடன் நாளும்</h3>
                        <h3>ஆசா ரத்துடன் அங்கந் துலக்கி</h3>
                        <br>
                        <h3>நேசமுடன் ஒரு நினைவது வாகிக்</h3>
                        <h3>கந்தர் சஷ்டிக் கவசம் இதனைச்</h3>
                        <h3>சிந்தை கலங்காது தியானிப் பவர்கள்</h3>
                        <h3>ஒருநாள் முப்பத் தாறுருக் கொண்டு</h3>
                        <h3>ஓதியே செபித்து உகந்துநீ றணிய</h3>
                        <br>
                        <h3>அஷ்டதிக் குள்ளோர் அடங்கிலும் வசமாய்த்</h3>
                        <h3>திசைமன்ன ரெண்மர் சேர்ந்தங்கு அருளுவர்</h3>
                        <h3>மற்றவ ரல்லாம் வந்து வணங்குவர்</h3>
                    </div>
                    <br>
                    <div style="border-bottom: 1px solid #000;margin-top: 125px;">
                    </div>
                    <h3>22</h3>
            </div>
            <div class="static_page">
                <%= render 'header_one' %>
                    <br>
                    <div class="left-align">
                        <h3>நவகோள் மகிழ்ந்து நன்மை யளித்திடும்</h3>
                        <h3>நவமதனெனவும் நல்லெழில் பெறுவர்</h3>
                        <h3>எந்த நாளுமீ ரட்டாய் வாழ்வார்</h3>
                        <h3>கந்தர்கை வேலாம் கவசத் தடியை</h3>
                        <br>
                        <h3>வழியாய்க் காண மெய்யாய் விளங்கும்</h3>
                        <h3>விழியாற் காண வெருண்டிடும் பேய்கள்</h3>
                        <h3>பொல்லா தவரைப் பொடிபொடி யாக்கும்</h3>
                        <h3>நல்லோர் நினைவில் நடனம் புரியும்</h3>
                        <br>
                        <h3>சர்வ சத்ரு சங்கா ரத்தடி</h3>
                        <h3>அறிந்தென துள்ளம் அஷ்ட லட்சுமிகளில்</h3>
                        <h3>வீரலட் சுமிக்கு விருந்துண வாகச்</h3>
                        <h3>சூரபத் மாவைத் துணித்தகை யதனால்</h3>
                        <h3>இருபத் தேழ்வர்க் குவந்தமு தளித்த</h3>
                        <br>
                        <h3>குருபரன் பழநிக் குன்றினி லிருக்கும்</h3>
                        <h3>சின்னக் குழந்தை சேவடி போற்றி!</h3>
                        <h3>எனைத்தடுத் தாட்கொள என்றன துள்ளம்</h3>
                        <h3>மேவிய வடிவுறும் வேலவா போற்றி!</h3>
                        <br>
                        <h3>தேவர்கள் சேனா பதியே போற்றி!</h3>
                        <h3>குறமகள் மனமகிழ் கோவே போற்றி!</h3>
                        <h3>திறமிகு திவ்விய தேகா போற்றி!</h3>
                        <h3>இடும்பா யுதனே இடும்பா போற்றி!</h3>
                        <br>
                        <h3>கடம்பா போற்றி கந்தா போற்றி!</h3>
                        <h3>வெட்சி புனையும் வேளே போற்றி!</h3>
                        <h3>உயர்கிரி கனக சபைக்கோ ரரசே!</h3>
                        <h3>மயில்நட மிடுவோய் மலரடி சரணம்!</h3>
                        <br>
                        <h3>சரணம் சரணம் சரவண பவஓம்</h3>
                        <h3>சரணம் சரணம் சண்முகா சரணம்!</h3>
                    </div>
                    <div style="border-bottom: 1px solid #000;margin-top: 40px;">
                    </div>
                    <h3>23</h3>
            </div>
            <%= render 'header_two' %>
                <div style="height: 1060px;"></div>
                <div style="border-bottom: 1px solid #000;"></div>
                <h3>24</h3>
                <%= render 'header_one' %>
                    <div style="height: 1060px;"></div>
                    <div style="border-bottom: 1px solid #000;"></div>
                    <h3>25</h3>
                    <%= render 'header_two' %>
                        <div style="height: 1060px;"></div>
                        <div style="border-bottom: 1px solid #000;"></div>
                        <h3>26</h3>
                        <%= render 'header_one' %>
                            <div style="height: 1060px;"></div>
                            <div style="border-bottom: 1px solid #000;"></div>
                            <h3>27</h3>
                            <%= render 'header_two' %>
                                <div style="height: 1060px;"></div>
                                <div style="border-bottom: 1px solid #000;"></div>
                                <h3>28</h3>
                                <div class="static_page">
                                    <%= render 'header_one' %>
                                        <br>
                                        <br>
                                        <br>
                                        <h3>இதயம் கனிந்த நன்றிகள்</h3>
                                        <br>
                                        <div style="text-align: left;margin-left: 50px; line-height: 0.50em !important;">
                                            <h3>எமது குடும்பவிளக்கு அணைந்த செய்தி கேட்டு ,</h3>
                                            <h3>உடன் வந்து பல வழிகளிலும உதவியவர்களுக்கும்,</h3>
                                            <h3>அனுதாபம் தெரிவித்தவர்களுக்கும், கண்ணீர் அஞ்சலி,</h3>
                                            <h3>துண்டுப்பிரசுரம் வெளியிட்ட பெரும்படை அம்மன் ஆலய</h3>
                                            <h3>பரிபாலன சபையினர்க்கும, தென்மராட்சி மேற்கு பல நோக்கு</h3>
                                            <h3>கூட்டுறவூச்சங்கத்தினருக்கும, உதயன் பத்திரிகை மூலமாக கண்ணீர்</h3>
                                            <h3>அஞ்சலி தெரிவித்து, நேரில் வந்து, மலர்மாலை அணிவித்து, அஞ்சலி</h3>
                                            <h3>செலுத்திய யா/கைதடி நாவற்குழி அ.த.க பாடசாலை அதிபர்,</h3>
                                            <h3>ஆசிரியர், மாணவர்கட்கும் இறுதிக்கிரியை நடாத்துவதற்கு, தோளோடு</h3>
                                            <h3>தோள் நின்று உதவிய நண்பர்கள், உற்றார் உறவினர்கட்கும்,</h3>
                                            <h3>சபிண்டீகரண நிகழ்விலும் வீட்டுக்கிருத்திய பிரார்த்தனையிலும் பங்கு</h3>
                                            <h3>கொண்டு சிறப்பித்தவர்களுக்கும் எமது மனமார்ந்த நன்றிகளை</h3>
                                            <h3>தெரிவித்துக்கொள்கின்றௌம்.</h3>
                                            <br>
                                            <h3>மேலும் எம்மை தொடர்பு கொள்ள kkratnam@gmail.com எனும்</h3>
                                            <h3>மின்னஞ்சல் முகவரியூடன் தொடர்பு</h3>
                                            <h3>கொள்ளவும்</h3>
                                        </div>
                                        <br>
                                        <div style="text-align: left;margin-left: 450px;line-height: 0.50em !important;">
                                            <h3>மனைவி</h3>
                                            <h3>பிள்ளைகள்</h3>
                                            <h3>பேரப்பிள்ளைகள்</h3>
                                            <h3>பூட்டப்பிள்ளைகள்</h3>
                                            <h3>சகோதரர்கள்</h3>
                                            <h3>24.06.2006</h3>
                                        </div>
                                        <div style="border-bottom: 1px solid #000; margin-top: 280px;"></div>
                                        <h3>29</h3>
                                </div>
        </div>
</body>

</html>
      `;
};

const generatePdf = params => {
  conversion({ html: obituaryPdfTemplate(params) }, function(err, pdf) {
    var output = fs.createWriteStream(`./pdf/${params.name}.pdf`);
    console.log(pdf.logs);
    console.log(pdf.numberOfPages);
    pdf.stream.pipe(output);
  });
};

app.get("/", function(req, res) {
  res.sendFile(path.join(__dirname + "/index.html"));
});

app.get("/pdf/:name", function(req, res) {
  res.sendFile(path.join(__dirname + `/pdf/${req.params.name}`));
});

app.get("/pdf", (req, res) => {
  generatePdf(req.query);
});

app.listen(8000);

console.log("Running at Port 8000");
